src/cf/src/DataProcessors/АРМУправлениеСтанками/АРМУправлениеСтанками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АРМУправлениеСтанками</name>
  <comment>Рабочее место «Управление станками»: состояние и загрузка станков, планировщик, размещение, автоплан и обслуживание.</comment>
</mdclass:DataProcessor>

src/cf/src/Documents/ОбслуживаниеСтанка/ОбслуживаниеСтанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбслуживаниеСтанка</name>
  <registerRecords>InformationRegister.ЗагрузкаСтанков</registerRecords>
  <attributes>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбслуживания</name>
    <type>
      <types>EnumRef.ВидыОбслуживанияСтанков</types>
    </type>
  </attributes>
  <attributes>
    <name>Плановое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Затраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/cf/src/Catalogs/ПроизводственноеОборудование/ПроизводственноеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПроизводственноеОборудование</name>
  <attributes>
    <name>ВидСтанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаСменуЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладСтанка</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Выведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаетБезКалендаря</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РежимРаботы</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоСмены</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеСмены</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Круглосуточно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыработкаПоНоменклатуре</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Выработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/DataProcessors/АРМУправлениеСтанками/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Обработки.АРМУправлениеСтанками.ПраваРабочегоМеста());
	НастроитьФорму();
	Если МожноВидетьСтанки Тогда
		ЗаполнитьСтанки();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НеделяСтанковПриИзменении(Элемент)

	ОбновитьСтанкиНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СтанкиСостояниеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Строка = СтанкиСостояние.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// Щелчок по «Сейчас» открывает загрузку на станке, по остальным колонкам - станок.
	Значение = ?(Поле = Элементы.СтанкиСостояниеСостояние И ЗначениеЗаполнено(Строка.Требование), Строка.Требование,
		Строка.Станок);
	ПоказатьЗначение(, Значение);

КонецПроцедуры

&НаКлиенте
Процедура СтанкиСостояниеПриАктивизацииСтроки(Элемент)

	// Время в «Готовых к запуску» считается на выбранном станке.
	ЗадержкаСекунд = 0.3;
	ПодключитьОбработчикОжидания("ОбновитьГотовыеКЗапуску", ЗадержкаСекунд, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ГотовыеКЗапускуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Строка = ГотовыеКЗапуску.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Строка <> Неопределено Тогда
		ПоказатьЗначение(, Строка.Заказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТребованияСтанковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Строка = ТребованияСтанков.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Строка <> Неопределено Тогда
		ПоказатьЗначение(, Строка.Требование);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикСтанковВыбор(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Для Каждого ЭлементПланировщика Из Элемент.ВыделенныеЭлементы Цикл
		Если ЗначениеЗаполнено(ЭлементПланировщика.Значение) Тогда
			ПоказатьЗначение(, ЭлементПланировщика.Значение);
			Возврат;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикСтанковПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)

	// Загрузка создаётся «Разместить» или перетаскиванием строки «Готовых к запуску», обслуживание - кнопкой.
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикСтанковПередУдалением(Элемент, Отказ)

	// Загрузку отменяют «Отменить», документ обслуживания - в его форме.
	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикСтанковПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)

	// Перетаскивание или растяжение элемента: документ меняется сервером (смена, шаг, сверка с фактом, проведение); элементы
	// перечитываются из базы в любом случае - положение на планировщике всегда то, что записано.
	ОтменаРедактирования = Истина;
	Если НовыйЭлемент Или Не МожноРазмещатьНаСтанки Тогда
		Возврат;
	КонецЕсли;
	Переносы = Новый Массив;
	Для Каждого ЭлементПланировщика Из Элемент.ВыделенныеЭлементы Цикл
		// Черновик автоплана без документа не переносится (ревью плана волны 5, P3-13).
		Если Не ЗначениеЗаполнено(ЭлементПланировщика.Значение) Тогда
			Продолжить;
		КонецЕсли;
		Перенос = Новый Структура("Документ, Станок, Начало", ЭлементПланировщика.Значение,
			ЭлементПланировщика.ЗначенияИзмерений.Получить("Станок"), ЭлементПланировщика.Начало);
		Перенос.Вставить("Окончание", ЭлементПланировщика.Конец);
		Переносы.Добавить(Перенос);
	КонецЦикла;
	Если Переносы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ТекстОшибки = ПеренестиЗагрузкиНаСервере(Переносы);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ПоказатьПредупреждение(, ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикСтанковПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата,
	ЗначенияИзмерений)

	Если ИдентификаторГотовой(ПараметрыПеретаскивания.Значение) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	Если МожноРазмещатьНаСтанки Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	Иначе
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикСтанковПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, ЗначенияИзмерений)

	Идентификатор = ИдентификаторГотовой(ПараметрыПеретаскивания.Значение);
	Если Идентификатор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	Станок = ?(ЗначенияИзмерений = Неопределено, Неопределено, ЗначенияИзмерений.Получить("Станок"));
	Если Не МожноРазмещатьНаСтанки Или Не ЗначениеЗаполнено(Станок) Тогда
		Возврат;
	КонецЕсли;
	ЗапроситьКоличествоРазмещения(Идентификатор, Станок, Дата);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СтанкиПредыдущаяНеделя(Команда)

	СдвинутьНеделюСтанков(-1);

КонецПроцедуры

&НаКлиенте
Процедура СтанкиСледующаяНеделя(Команда)

	СдвинутьНеделюСтанков(1);

КонецПроцедуры

&НаКлиенте
Процедура СтанкиОбновить(Команда)

	ОбновитьСтанкиНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СтанкиРазместить(Команда)

	ТекущиеДанные = Элементы.ГотовыеКЗапуску.ТекущиеДанные;
	Станок = ВыбранныйСтанок();
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(Станок) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите станок в списке станков и строку на закладке «Готовы к запуску»';
			|fr = 'Choisissez une machine dans la liste et une ligne dans l''onglet « Prêt à lancer »';
			|en = 'Select a machine in the machine list and a line on the ""Ready to start"" tab';
			|es = 'Elija una máquina en la lista y una línea en la pestaña «Listo para iniciar»'"));
		Возврат;
	КонецЕсли;
	ЗапроситьКоличествоРазмещения(ТекущиеДанные.ПолучитьИдентификатор(), Станок, Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура СтанкиАвтоплан(Команда)

	РассчитатьАвтопланНаСервере();
	Если Автоплан.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Нет строк, готовых к запуску'; fr = 'Aucune ligne prête à lancer';
			|en = 'No lines ready to start'; es = 'No hay líneas listas para iniciar'"));
		Возврат;
	КонецЕсли;
	Элементы.ГруппаСтанкиНиз.ТекущаяСтраница = Элементы.СтраницаАвтоплан;

КонецПроцедуры

&НаКлиенте
Процедура СтанкиПринятьАвтоплан(Команда)

	Если Автоплан.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Сначала рассчитайте автоплан'; fr = 'Calculez d''abord la planification automatique';
			|en = 'Calculate the auto-plan first'; es = 'Primero calcule la planificación automática'"));
		Возврат;
	КонецЕсли;
	ТекстОшибки = ПринятьАвтопланНаСервере();
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ПоказатьПредупреждение(, ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтанкиЗапустить(Команда)

	ВыполнитьДействиеЗагрузки("Запустить");

КонецПроцедуры

&НаКлиенте
Процедура СтанкиЗавершить(Команда)

	ВыполнитьДействиеЗагрузки("Завершить");

КонецПроцедуры

&НаКлиенте
Процедура СтанкиОтменить(Команда)

	ВыполнитьДействиеЗагрузки("Отменить");

КонецПроцедуры

&НаКлиенте
Процедура СтанкиОбслуживание(Команда)

	ЗначенияЗаполнения = Новый Структура;
	Станок = ВыбранныйСтанок();
	Если ЗначениеЗаполнено(Станок) Тогда
		ЗначенияЗаполнения.Вставить("Станок", Станок);
	КонецЕсли;
	ОткрытьФорму("Документ.ОбслуживаниеСтанка.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения),
		ЭтотОбъект, , , , Новый ОписаниеОповещения("ПослеЗакрытияДокументаСтанков", ЭтотОбъект));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Рабочее место «Управление станками» (бывшая закладка «Станки» рабочего места производства):
// данные и действия - функции общего модуля ЗагрузкаСтанков, здесь - только заполнение реквизитов формы и диалоги.

&НаСервере
Процедура НастроитьФорму()

	// Без учёта станков или прав на загрузку форма не отказывает, а объясняет, почему пусто (её открывает и смок).
	Элементы.НадписьНетУчетаСтанков.Видимость = Не МожноВидетьСтанки;
	Для Каждого ИмяЭлемента Из СтрРазделить("СтанкиСостояние,НеделяСтанков,ПланировщикСтанков,ГруппаСтанкиНиз", ",") Цикл
		Элементы[ИмяЭлемента].Видимость = МожноВидетьСтанки;
	КонецЦикла;
	Если Не МожноВидетьСтанки Тогда
		Возврат;
	КонецЕсли;
	НеделяСтанков = НачалоНедели(ТекущаяДатаСеанса());
	Для Каждого ИмяКнопки Из СтрРазделить("Разместить,Запустить,Завершить,Отменить,Автоплан,ПринятьАвтоплан", ",") Цикл
		Элементы["КнопкаСтанки" + ИмяКнопки].Видимость = МожноРазмещатьНаСтанки;
	КонецЦикла;
	Элементы.КнопкаСтанкиОбслуживание.Видимость = МожноОбслуживаниеСтанков;
	Элементы.ГотовыеКЗапускуХарактеристика.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");

	// Строка «Готовых к запуску», которую станок не успевает сделать к дню отгрузки, - красным.
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГотовыеКЗапуску.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГотовыеКЗапуску.Просрочен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.Цвет_Красный);

	// Строка черновика автоплана, которая не успевает к отгрузке, - тоже красным.
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Автоплан.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Автоплан.Просрочен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.Цвет_Красный);

КонецПроцедуры

&НаСервере
Процедура ОбновитьСтанкиНаСервере()

	ЗаполнитьСтанки();

КонецПроцедуры

&НаСервере
Процедура СдвинутьНеделюСтанков(Знач Недель)

	ДнейВНеделе = 7;
	НеделяСтанков = НачалоНедели(НеделяСтанков) + Недель * ДнейВНеделе * ЗагрузкаСтанков.СекундВСутках();
	ЗаполнитьСтанки();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтанки()

	НеделяСтанков = НачалоНедели(?(ЗначениеЗаполнено(НеделяСтанков), НеделяСтанков, ТекущаяДатаСеанса()));
	Начало = НеделяСтанков;
	Окончание = КонецНедели(Начало) + 1;
	Станки = ДействующиеСтанки();
	ТекущийСтанок = СтанокТекущейСтроки();
	СтанкиСостояние.Загрузить(ЗагрузкаСтанков.СостояниеСтанков(Станки, Начало, Окончание));
	Для Каждого Строка Из СтанкиСостояние Цикл
		Если Строка.Станок = ТекущийСтанок Тогда
			Элементы.СтанкиСостояние.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЦикла;
	Занятость = ЗагрузкаСтанков.ЗанятостьСтанков(Станки, Начало, Окончание);
	ЗаполнитьПланировщикСтанков(Станки, Начало, Окончание, Занятость);
	ЗаполнитьТребованияСтанков(Занятость);
	ЗаполнитьГотовыеКЗапуску();
	// Черновик автоплана живёт до «Обновить», смены недели и любого действия рабочего места: он посчитан от того момента.
	Автоплан.Очистить();
	СтанкиЗаполнены = Истина;

КонецПроцедуры

&НаСервере
Функция ДействующиеСтанки()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Станки.Ссылка КАК Станок
	|ИЗ
	|	Справочник.ПроизводственноеОборудование КАК Станки
	|ГДЕ
	|	НЕ Станки.ПометкаУдаления
	|	И НЕ Станки.Выведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Станки.Наименование";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Станок");

КонецФункции

&НаСервере
Функция СтанокТекущейСтроки()

	Идентификатор = Элементы.СтанкиСостояние.ТекущаяСтрока;
	Строка = ?(Идентификатор = Неопределено, Неопределено, СтанкиСостояние.НайтиПоИдентификатору(Идентификатор));
	Если Строка = Неопределено И СтанкиСостояние.Количество() > 0 Тогда
		Строка = СтанкиСостояние[0];
	КонецЕсли;
	Возврат ?(Строка = Неопределено, Справочники.ПроизводственноеОборудование.ПустаяСсылка(), Строка.Станок);

КонецФункции

&НаСервере
Процедура ЗаполнитьПланировщикСтанков(Станки, Начало, Окончание, Занятость)

	ПланировщикСтанков.Элементы.Очистить();
	ПланировщикСтанков.Измерения.Очистить();
	ПланировщикСтанков.ИнтервалыФона.Очистить();
	ПланировщикСтанков.ТекущиеПериодыОтображения.Очистить();
	// Период - до конца недели включительно: без лишней ленты следующего понедельника на границе.
	ПланировщикСтанков.ТекущиеПериодыОтображения.Добавить(Начало, Окончание - 1);
	ПланировщикСтанков.ОтображениеВремениЭлементов = ОтображениеВремениЭлементовПланировщика.ВремяНачалаИКонца;
	// Станки - строками, неделя - одной лентой слева направо, шкала сверху (tiny1C forms-024).
	ПланировщикСтанков.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Неделя;
	ПланировщикСтанков.КратностьПериодическогоВарианта = 1;
	ПланировщикСтанков.ШкалаВремени.Положение = ПоложениеШкалыВремени.Верх;
	НастроитьШкалуСтанков();

	Измерение = ПланировщикСтанков.Измерения.Добавить("Станок", НСтр("ru = 'Станок'; fr = 'Machine'; en = 'Machine'; es = 'Máquina'"));
	Для Каждого Станок Из Станки Цикл
		Измерение.Элементы.Добавить(Станок, Строка(Станок));
	КонецЦикла;
	ДобавитьНерабочееВремяСтанков(Станки, Начало, Окончание);
	Для Каждого Запись Из Занятость Цикл
		ДобавитьЭлементЗанятости(Запись);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура НастроитьШкалуСтанков()

	ЭлементыШкалы = ПланировщикСтанков.ШкалаВремени.Элементы;
	Если ЭлементыШкалы.Количество() = 0 Тогда
		ЭлементыШкалы.Добавить();
	КонецЕсли;
	ШкалаДней = ЭлементыШкалы.Получить(0);
	ШкалаДней.Единица = ТипЕдиницыШкалыВремени.День;
	ШкалаДней.Кратность = 1;
	ШкалаДней.Формат = "ДФ='ddd dd.MM'";
	ШкалаЧасов = ?(ЭлементыШкалы.Количество() > 1, ЭлементыШкалы.Получить(1), ЭлементыШкалы.Добавить());
	ШкалаЧасов.Единица = ТипЕдиницыШкалыВремени.Час;
	ШкалаЧасов.Кратность = ЧасовВДеленииШкалыСтанков();
	ШкалаЧасов.Формат = "ДФ=HH";

КонецПроцедуры

&НаСервере
Процедура ДобавитьНерабочееВремяСтанков(Станки, Начало, Окончание)

	// Фон - нерабочее время каждого станка: дополнение рабочих интервалов режима до недели.
	Интервалы = ЗагрузкаСтанков.ИнтервалыРаботыСтанков(Станки, Начало, Окончание);
	Для Каждого Станок Из Станки Цикл
		Свободно = Начало;
		Для Каждого Интервал Из Интервалы.НайтиСтроки(Новый Структура("Станок", Станок)) Цикл
			Если Интервал.Начало > Свободно Тогда
				ДобавитьИнтервалФонаСтанка(Станок, Свободно, Интервал.Начало);
			КонецЕсли;
			Свободно = Интервал.Окончание;
		КонецЦикла;
		Если Свободно < Окончание Тогда
			ДобавитьИнтервалФонаСтанка(Станок, Свободно, Окончание);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьИнтервалФонаСтанка(Станок, Начало, Окончание)

	Интервал = ПланировщикСтанков.ИнтервалыФона.Добавить(Начало, Окончание);
	Интервал.Цвет = WebЦвета.СветлоСерый;
	Интервал.ЗначенияИзмерений = ЗначенияИзмеренийСтанка(Станок);

КонецПроцедуры

// Элемент планировщика по записи занятости: требования - план голубой, факт тёмный, затянувшаяся загрузка кирпичная;
// обслуживание - серое (план светлее). Переносится и растягивается только план (растяжение - волна 5).
//
// Параметры:
//  Запись - СтрокаТаблицыЗначений - строка ЗагрузкаСтанков.ЗанятостьСтанков
//
&НаСервере
Процедура ДобавитьЭлементЗанятости(Запись)

	ЭтоТребование = ТипЗнч(Запись.Регистратор) = Тип("ДокументСсылка.ТребованиеНакладная");
	ЭлементПланировщика = ПланировщикСтанков.Элементы.Добавить(Запись.Начало, Запись.Окончание);
	ЭлементПланировщика.Значение = Запись.Регистратор;
	ЭлементПланировщика.Текст = Запись.Текст;
	ЭлементПланировщика.ЗначенияИзмерений = ЗначенияИзмеренийСтанка(Запись.Станок);
	Если Запись.Затянулась Тогда
		ЭлементПланировщика.ЦветФона = WebЦвета.Кирпичный;
		ЭлементПланировщика.ЦветТекста = WebЦвета.Белый;
	ИначеЕсли ЭтоТребование Тогда
		ЭлементПланировщика.ЦветФона = ?(Запись.План, WebЦвета.Голубой, WebЦвета.ТемноСерый);
		ЭлементПланировщика.ЦветТекста = ?(Запись.План, WebЦвета.Черный, WebЦвета.Белый);
	Иначе
		ЭлементПланировщика.ЦветФона = ?(Запись.План, WebЦвета.СеребристоСерый, WebЦвета.Серый);
	КонецЕсли;
	Режимы = РежимРазрешенияРедактированияЭлементаПланировщика;
	ЭлементПланировщика.РежимРазрешенияРедактирования = ?(Запись.План И МожноРазмещатьНаСтанки,
		Режимы.РазрешитьРедактирование, Режимы.ЗапретитьРедактирование);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТребованияСтанков(Занятость)

	ТребованияСтанков.Очистить();
	Для Каждого Запись Из Занятость Цикл
		Если ТипЗнч(Запись.Регистратор) <> Тип("ДокументСсылка.ТребованиеНакладная") Тогда
			Продолжить;
		КонецЕсли;
		Строка = ТребованияСтанков.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Запись, "Статус, Станок, НомерЗаказа, Количество, Начало, Окончание");
		Строка.НомерЗаказа = СокрЛП(Запись.НомерЗаказа);
		Строка.Требование = Запись.Регистратор;
		Строка.Номенклатура = Запись.Продукция;
	КонецЦикла;
	ТребованияСтанков.Сортировать("Начало");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГотовыеКЗапуску()

	ГотовыеКЗапуску.Очистить();
	СоСклада = НСтр("ru = 'со склада'; fr = 'en stock'; en = 'from stock'; es = 'del almacén'");
	ПодЗаказ = НСтр("ru = 'под заказ'; fr = 'pour la commande'; en = 'for the order'; es = 'para el pedido'");
	Для Каждого Готовая Из ЗагрузкаСтанков.ГотовыеКЗапуску(СтанокТекущейСтроки()) Цикл
		Строка = ГотовыеКЗапуску.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Готовая);
		Строка.Время = ?(Готовая.Часы > 0, ЗагрузкаСтанков.ПредставлениеЧасов(Готовая.Часы), "");
		Строка.Источник = ?(Готовая.ИзСклада, СоСклада, ПодЗаказ);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГотовыеКЗапуску()

	Если СтанкиЗаполнены Тогда
		ОбновитьГотовыеКЗапускуНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьГотовыеКЗапускуНаСервере()

	ЗаполнитьГотовыеКЗапуску();

КонецПроцедуры

&НаКлиенте
Функция ВыбранныйСтанок()

	ТекущиеДанные = Элементы.СтанкиСостояние.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Возврат ТекущиеДанные.Станок;
	КонецЕсли;
	Возврат ?(СтанкиСостояние.Количество() > 0, СтанкиСостояние[0].Станок, Неопределено);

КонецФункции

// Идентификатор строки «Готовых к запуску» в параметрах перетаскивания: значение - идентификатор строки или массив
// идентификаторов; перетаскивается одна строка.
//
// Параметры:
//  Значение - Число, Массив из Число, Произвольный - ПараметрыПеретаскивания.Значение
//
// Возвращаемое значение:
//  Число, Неопределено - идентификатор строки «Готовых к запуску»; Неопределено - перетаскивают не её
//
&НаКлиенте
Функция ИдентификаторГотовой(Значение)

	Идентификатор = Значение;
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		Если Значение.Количество() <> 1 Тогда
			Возврат Неопределено;
		КонецЕсли;
		Идентификатор = Значение[0];
	КонецЕсли;
	Если ТипЗнч(Идентификатор) <> Тип("Число") Или ГотовыеКЗапуску.НайтиПоИдентификатору(Идентификатор) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Идентификатор;

КонецФункции

&НаКлиенте
Процедура ЗапроситьКоличествоРазмещения(Идентификатор, Станок, Начало)

	Строка = ГотовыеКЗапуску.НайтиПоИдентификатору(Идентификатор);
	ПараметрыРазмещения = Новый Структура("Идентификатор, Станок, Начало", Идентификатор, Станок, Начало);
	Шаблон = НСтр("ru = 'Сколько разместить на станок «%1»'; fr = 'Quantité à planifier sur « %1 »';
		|en = 'Quantity to place on ""%1""'; es = 'Cantidad a planificar en «%1»'");
	ЗаголовокВвода = СтрШаблон(Шаблон, Станок);
	РазрядностьКоличества = 15;
	ТочностьКоличества = 3;
	ПоказатьВводЧисла(Новый ОписаниеОповещения("РазместитьПослеВводаКоличества", ЭтотОбъект, ПараметрыРазмещения), Строка.Остаток,
		ЗаголовокВвода, РазрядностьКоличества, ТочностьКоличества);

КонецПроцедуры

&НаКлиенте
Процедура РазместитьПослеВводаКоличества(Количество, ПараметрыРазмещения) Экспорт

	Если Количество = Неопределено Или Количество <= 0 Тогда
		Возврат;
	КонецЕсли;
	ТекстОшибки = РазместитьНаСервере(ПараметрыРазмещения.Идентификатор, Количество, ПараметрыРазмещения.Станок,
		ПараметрыРазмещения.Начало);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ПоказатьПредупреждение(, ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция РазместитьНаСервере(Знач Идентификатор, Знач Количество, Знач Станок, Знач Начало)

	Строка = ГотовыеКЗапуску.НайтиПоИдентификатору(Идентификатор);
	Если Строка = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Результат = ЗагрузкаСтанков.РазместитьСтроку(Строка.Заказ, Строка.КодСтроки, Количество, Станок, Начало);
	ЗаполнитьСтанки();
	Возврат Результат.ТекстОшибки;

КонецФункции

&НаСервере
Функция ПеренестиЗагрузкиНаСервере(Знач Переносы)

	Тексты = Новый Массив;
	Для Каждого Перенос Из Переносы Цикл
		ТекстОшибки = ЗагрузкаСтанков.ИзменитьЗагрузку(Перенос.Документ, Перенос.Станок, Перенос.Начало, Перенос.Окончание);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			Тексты.Добавить(ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьСтанки();
	Возврат СтрСоединить(Тексты, Символы.ПС);

КонецФункции

// Черновик автоплана: рабочее место перечитывается, предложение - в таблицу «Автоплан» и светло-зелёными элементами на
// планировщик (размещения в показанной неделе).
//
&НаСервере
Процедура РассчитатьАвтопланНаСервере()

	ЗаполнитьСтанки();
	Автоплан.Загрузить(ЗагрузкаСтанков.ПредложениеАвтоплана());
	Начало = НачалоНедели(НеделяСтанков);
	Окончание = КонецНедели(Начало) + 1;
	Шаблон = НСтр("ru = 'Автоплан: %1 / %2'; fr = 'Planification : %1 / %2'; en = 'Auto-plan: %1 / %2';
		|es = 'Planificación: %1 / %2'");
	Для Каждого Строка Из Автоплан Цикл
		Если ЗначениеЗаполнено(Строка.ТекстОшибки) Или Строка.Окончание <= Начало Или Строка.Начало >= Окончание Тогда
			Продолжить;
		КонецЕсли;
		ЭлементПланировщика = ПланировщикСтанков.Элементы.Добавить(Строка.Начало, Строка.Окончание);
		ЭлементПланировщика.Текст = СтрШаблон(Шаблон, Строка.НомерЗаказа, Строка.Номенклатура);
		ЭлементПланировщика.ЗначенияИзмерений = ЗначенияИзмеренийСтанка(Строка.Станок);
		ЭлементПланировщика.ЦветФона = WebЦвета.СветлоЗеленый;
		ЭлементПланировщика.ЦветТекста = WebЦвета.Черный;
		ЭлементПланировщика.РежимРазрешенияРедактирования =
			РежимРазрешенияРедактированияЭлементаПланировщика.ЗапретитьРедактирование;
	КонецЦикла;

КонецПроцедуры

// «Принять автоплан»: строки черновика размещаются по очереди, рабочее место перечитывается.
//
// Возвращаемое значение:
//  Строка - тексты ошибок неразмещённых строк; пустая - всё размещено
//
&НаСервере
Функция ПринятьАвтопланНаСервере()

	Результат = ЗагрузкаСтанков.ПринятьАвтоплан(Автоплан.Выгрузить());
	ЗаполнитьСтанки();
	Возврат СтрСоединить(Результат.Ошибки, Символы.ПС);

КонецФункции

// Требование для «Запустить», «Завершить», «Отменить»: строка «Требований», если список активен, иначе выделенный
// элемент планировщика, иначе текущая строка «Требований».
//
// Возвращаемое значение:
//  ДокументСсылка.ТребованиеНакладная, Неопределено - требование
//
&НаКлиенте
Функция ВыбранноеТребование()

	ТекущиеДанные = Элементы.ТребованияСтанков.ТекущиеДанные;
	Если ТекущийЭлемент <> Элементы.ТребованияСтанков Тогда
		Для Каждого ЭлементПланировщика Из Элементы.ПланировщикСтанков.ВыделенныеЭлементы Цикл
			Если ТипЗнч(ЭлементПланировщика.Значение) = Тип("ДокументСсылка.ТребованиеНакладная") Тогда
				Возврат ЭлементПланировщика.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат ?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.Требование);

КонецФункции

&НаКлиенте
Процедура ВыполнитьДействиеЗагрузки(Действие)

	Требование = ВыбранноеТребование();
	Если Не ЗначениеЗаполнено(Требование) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите загрузку на планировщике или в списке «Требования»';
			|fr = 'Choisissez une charge dans le planificateur ou dans la liste « Bons »';
			|en = 'Select a load in the planner or in the ""Requisitions"" list';
			|es = 'Elija una carga en el planificador o en la lista «Vales»'"));
		Возврат;
	КонецЕсли;
	ПараметрыДействия = Новый Структура("Требование, Действие", Требование, Действие);
	Если Действие = "Завершить" Тогда
		Найденные = ТребованияСтанков.НайтиСтроки(Новый Структура("Требование", Требование));
		Количество = ?(Найденные.Количество() = 0, 0, Найденные[0].Количество);
		РазрядностьКоличества = 15;
		ТочностьКоличества = 3;
		ПоказатьВводЧисла(Новый ОписаниеОповещения("ВыполнитьДействиеПослеВвода", ЭтотОбъект, ПараметрыДействия), Количество,
			НСтр("ru = 'Выпущено продукции'; fr = 'Quantité produite'; en = 'Quantity produced'; es = 'Cantidad producida'"),
			РазрядностьКоличества, ТочностьКоличества);
	ИначеЕсли Действие = "Отменить" Тогда
		Шаблон = НСтр("ru = 'Отменить загрузку %1?'; fr = 'Annuler la charge %1 ?'; en = 'Cancel load %1?';
			|es = '¿Cancelar la carga %1?'");
		Вопрос = СтрШаблон(Шаблон, Требование);
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьДействиеПослеВвода", ЭтотОбъект, ПараметрыДействия), Вопрос,
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьДействиеПослеВвода(0, ПараметрыДействия);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПослеВвода(Ответ, ПараметрыДействия) Экспорт

	КоличествоФакт = 0;
	Если ПараметрыДействия.Действие = "Завершить" Тогда
		Если Ответ = Неопределено Или Ответ <= 0 Тогда
			Возврат;
		КонецЕсли;
		КоличествоФакт = Ответ;
	ИначеЕсли ПараметрыДействия.Действие = "Отменить" И Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	Иначе
		// «Запустить» и подтверждённая отмена выполняются без количества.
		КоличествоФакт = 0;
	КонецЕсли;
	ТекстОшибки = ВыполнитьДействиеНаСервере(ПараметрыДействия.Требование, ПараметрыДействия.Действие, КоличествоФакт);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ПоказатьПредупреждение(, ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВыполнитьДействиеНаСервере(Знач Требование, Знач Действие, Знач КоличествоФакт)

	ТекстОшибки = ЗагрузкаСтанков.ВыполнитьДействиеТребования(Требование, Действие, КоличествоФакт);
	ЗаполнитьСтанки();
	Возврат ТекстОшибки;

КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияДокументаСтанков(Результат, ДополнительныеПараметры) Экспорт

	ОбновитьСтанкиНаСервере();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияИзмеренийСтанка(Станок)

	Значения = Новый Соответствие;
	Значения.Вставить("Станок", Станок);
	Возврат Новый ФиксированноеСоответствие(Значения);

КонецФункции

&НаСервереБезКонтекста
Функция ЧасовВДеленииШкалыСтанков()

	Возврат 4;

КонецФункции

#КонецОбласти
